package com.owl.wifi.web.talkingdata.controller;

import java.io.BufferedReader;
import java.io.FileReader;
import java.util.ArrayList;
import java.util.LinkedHashMap;
import java.util.List;
import java.util.Map;

import com.google.gson.Gson;

public class LabelDataBase {

        protected static Map<String, String> gameLabelMap;

        protected static Map<String, String> applyInterestMap;

        protected static Map<String, String> offlineXfLabelMap;

        protected static Map<String, String> bankingLabelMap;

        protected static Map<String, String> personPropertiesMap;

        static {
                if (gameLabelMap == null) {
                        gameLabelMap = new LinkedHashMap<String, String>();
                        {
                                gameLabelMap.put("010101",
                                                "{'休闲时间': [{'01010101': '切东西'}, {'01010102': '找茬'}, {'01010103': '减压'}, {'01010104': '宠物'}, {'01010105': '答题'}, {'01010106': '捕鱼'}, {'01010107': '音乐舞蹈'}, {'01010108': '益智'}, {'01010109': '冒险解谜'}]}");
                                gameLabelMap.put("010102",
                                                "{'跑酷竞速': [{'01010201': '跑酷'}, {'01010202': '赛车'}, {'01010203': '摩托'}, {'01010204': '赛艇'}, {'01010205': '飞机'}]}");
                                gameLabelMap.put("010103",
                                                "{'宝石消除': [{'01010301': '方块'}, {'01010302': '宝石'}, {'01010303': '连连看'}, {'01010304': '祖玛'}, {'01010305': '泡泡龙'}, {'01010306': '卡通'}]}");
                                gameLabelMap.put("010104",
                                                "{'网络游戏': [{'01010401': '角色扮演网游'}, {'01010402': '动作竞技'}, {'01010403': '策略'}, {'01010404': '卡牌'}, {'01010405': '经营模拟'}]}");
                                gameLabelMap.put("010105",
                                                "{'动作射击': [{'01010501': '横版'}, {'01010502': '射击'}, {'01010503': '3D'}, {'01010504': '飞行'}, {'01010505': '坦克'}, {'01010506': '狙击'}]}");
                                gameLabelMap.put("010106",
                                                "{'扑克棋牌': [{'01010601': '斗地主'}, {'01010602': '棋类'}, {'01010603': '麻将'}, {'01010604': '桌游'}, {'01010605': '德州扑克'}, {'01010606': '纸牌'}]}");
                                gameLabelMap.put("010107",
                                                "{'儿童益智': [{'01010701': '拼图'}, {'01010702': '识字'}, {'01010703': '智力开发'}, {'01010704': '数学'}]}");
                                gameLabelMap.put("010108", "{'塔防守卫': [{'01010801': '闯关'}, {'01010802': '抢滩登陆'}]}");
                                gameLabelMap.put("010109",
                                                "{'体育格斗': [{'01010901': '街机'}, {'01010902': '篮球'}, {'01010903': '足球'}, {'01010904': '网球'}, {'01010905': '台球'}, {'01010906': '其他球类'}]}");
                                gameLabelMap.put("010110",
                                                "{'角色扮演': [{'01011001': '回合制'}, {'01011002': '即时战斗'}, {'01011003': 'ARPG'}]}");
                                gameLabelMap.put("010111",
                                                "{'经营策略': [{'01011101': '战棋'}, {'01011102': '经营'}, {'01011103': '农场家园'}]}");
                                gameLabelMap.put("010112", "{'养成类': [{'01011201': '宠物养成类'}, {'01011202': '恋爱养成'}]}");
                        }
                }

                if (applyInterestMap == null) {
                        applyInterestMap = new LinkedHashMap<String, String>();
                        {
                                applyInterestMap.put("020101",
                                                "{'网购': [{'02010101': '网上商城'}, {'02010102': '团购'}, {'02010103': '导购'}, {'02010104': '比价'}, {'02010105': '购物分享'}, {'02010106': '海淘'}]}");
                                applyInterestMap.put("020102",
                                                "{'教育': [{'02010201': '早教'}, {'02010202': '课外辅导'}, {'02010203': '留学出国'}, {'02010204': '外语'}, {'02010205': '专业技能'}, {'02010206': '管理'}, {'02010207': '文化艺术'}, {'02010208': '图书音像'}, {'02010209': '考试'}, {'02010210': '方言'}, {'02010211': '课程管理'}]}");
                                applyInterestMap.put("020103",
                                                "{'阅读': [{'02010301': '胎教读物'}, {'02010302': '少儿读物'}, {'02010303': '小说'}, {'02010304': '期刊杂志'}, {'02010305': '漫画'}, {'02010306': '词典翻译'}, {'02010307': '阅读平台'}, {'02010308': '诗词名著'}, {'02010309': '笑话'}, {'02010310': '心理'}, {'02010311': '科普'}]}");
                                applyInterestMap.put("020104",
                                                "{'资讯': [{'02010401': '新闻资讯'}, {'02010402': '娱乐资讯'}, {'02010403': '学术资讯'}, {'02010404': '体育资讯'}, {'02010405': '财经资讯'}, {'02010406': '科技资讯'}, {'02010407': '游戏攻略'}]}");
                                applyInterestMap.put("020105",
                                                "{'社交': [{'02010501': '微博'}, {'02010502': '婚恋'}, {'02010503': '交友\\社区'}, {'02010504': '图片分享'}, {'02010505': '博客论坛'}]}");
                                applyInterestMap.put("020106",
                                                "{'通讯': [{'02010601': '即时通讯'}, {'02010602': '短信'}, {'02010603': '邮件'}, {'02010604': '电话'}]}");
                                applyInterestMap.put("020107",
                                                "{'影音': [{'02010701': '电台'}, {'02010702': '音乐'}, {'02010703': '视频'}, {'02010704': '秀场'}, {'02010705': '有声读物'}]}");
                                applyInterestMap.put("020108",
                                                "{'商旅出行': [{'02010801': '地图'}, {'02010802': '导航'}, {'02010803': '代驾'}, {'02010804': '打车'}, {'02010805': '租车'}, {'02010806': '航班'}, {'02010807': '公交'}, {'02010808': '火车'}, {'02010809': '酒店应用'}, {'02010810': '旅游资讯'}, {'02010811': '旅游产品'}, {'02010812': '游记分享'}, {'02010813': '长途客车'}]}");
                                applyInterestMap.put("020109",
                                                "{'家居': [{'02010901': '装潢'}, {'02010902': '家电'}, {'02010903': '家具'}, {'02010904': '家居用品'}, {'02010905': '智能家居'}, {'02010906': '智能家电'}, {'02010907': '智能硬件'}]}");
                                applyInterestMap.put("020110",
                                                "{'健康': [{'02011001': '减肥'}, {'02011002': '运动健身'}, {'02011003': '养生'}, {'02011004': '医疗'}, {'02011005': '健康管理'}, {'02011006': '健康可穿戴'}]}");
                                applyInterestMap.put("020111",
                                                "{'生活': [{'02011101': '拍照摄影'}, {'02011102': '文玩收藏'}, {'02011103': '外卖订餐'}, {'02011104': '占星运程'}, {'02011105': '优惠券'}, {'02011106': '点评'}, {'02011107': '食谱'}, {'02011108': '营业厅'}, {'02011109': '天气'}, {'02011110': '时钟'}, {'02011111': '快递'}, {'02011112': '日历'}, {'02011113': '记账'}, {'02011114': '车主服务'}, {'02011115': '便民服务'}, {'02011116': '时尚穿搭'}, {'02011117': '积分活动'}, {'02011118': '家政'}, {'02011119': '生活综合'}]}");
                                applyInterestMap.put("020112",
                                                "{'工作': [{'02011201': '招聘求职'}, {'02011202': '日程管理'}, {'02011203': '笔记'}, {'02011204': '备忘'}, {'02011205': '文件编辑'}, {'02011206': '名片'}, {'02011207': '通讯录'}, {'02011208': '网盘'}, {'02011209': '店铺管理'}, {'02011210': '工程制图'}]}");
                                applyInterestMap.put("020113",
                                                "{'手机工具': [{'02011301': '系统工具'}, {'02011302': '应用商店'}, {'02011303': '搜索'}, {'02011304': '输入法'}, {'02011305': '浏览器'}, {'02011306': '桌面美化'}, {'02011307': '阅读器'}, {'02011308': '实用工具'}, {'02011309': '编辑器'}, {'02011310': 'WIFI'}]}");
                                applyInterestMap.put("020114",
                                                "{'金融理财': [{'02011401': '财富管理'}, {'02011402': '货币基金'}, {'02011403': '直销银行'}, {'02011404': '直销保险'}, {'02011405': '证券'}, {'02011406': '期货'}, {'02011407': '外汇'}, {'02011408': '贵金属'}, {'02011409': '众筹融资'}, {'02011410': '彩票'}, {'02011411': '支付'}, {'02011412': '借贷'}, {'02011413': '手机银行'}, {'02011414': '保险'}]}");
                                applyInterestMap.put("020115",
                                                "{'房产': [{'02011501': '房屋咨询'}, {'02011502': '买房'}, {'02011503': '卖房'}, {'02011504': '租房'}]}");
                                applyInterestMap.put("020116",
                                                "{'母婴': [{'02011601': '怀孕备孕'}, {'02011602': '育儿'}, {'02011603': '母婴用品类'}]}");
                                applyInterestMap.put("020117",
                                                "{'娱乐': [{'02011701': 'KTV'}, {'02011702': '演出'}, {'02011703': '电影'}]}");
                                applyInterestMap.put("020118", "{'汽车': [{'02011801': '汽车资讯'}, {'02011802': '买卖车'}]}");
                                applyInterestMap.put("020119",
                                                "{'个护美容': [{'02011901': '护肤类应用'}, {'02011902': '美容美发美甲'}, {'02011903': '彩妆类应用'}]}");
                        }
                }

                if (offlineXfLabelMap == null) {
                        offlineXfLabelMap = new LinkedHashMap<String, String>();
                        {
                                offlineXfLabelMap.put("040101",
                                                "{'珠宝手表': [{'04010101': '品牌手表'}, {'04010102': '珠宝饰品'}]}");
                                offlineXfLabelMap.put("040102",
                                                "{'服饰鞋帽': [{'04010201': '女装'}, {'04010202': '女鞋'}, {'04010203': '男装'}, {'04010204': '男鞋'}, {'04010205': '运动户外'}, {'04010206': '内衣'}, {'04010207': '家居服装'}, {'04010208': '配饰'}, {'04010209': '童装'}, {'04010210': '童鞋'}, {'04010211': '集合店'}]}");
                                offlineXfLabelMap.put("040103",
                                                "{'家居厨具': [{'04010301': '床上用品'}, {'04010302': '家居装饰'}, {'04010303': '卫浴产品'}, {'04010304': '装修建材'}, {'04010305': '家具'}, {'04010306': '厨具'}, {'04010307': '餐具'}, {'04010308': '茶具杯具'}, {'04010309': '洗涤用品'}]}");
                                offlineXfLabelMap.put("040104",
                                                "{'运动健康': [{'04010401': '户外装备'}, {'04010402': '游泳用品'}, {'04010403': '健身器材'}, {'04010404': '骑行运动'}, {'04010405': '垂钓用品'}, {'04010406': '舞蹈'}]}");
                                offlineXfLabelMap.put("040105",
                                                "{'箱包': [{'04010501': '女包'}, {'04010502': '男包'}, {'04010503': '钱包'}, {'04010504': '功能包'}, {'04010505': '旅行箱'}]}");
                                offlineXfLabelMap.put("040106",
                                                "{'母婴用品': [{'04010601': '婴儿服饰'}, {'04010602': '孕妈用品'}, {'04010603': '婴儿食品'}, {'04010604': '婴儿护理'}, {'04010605': '童车床'}, {'04010606': '婴幼家纺'}]}");
                                offlineXfLabelMap.put("040107",
                                                "{'数码': [{'04010701': '相机'}, {'04010702': '手机'}, {'04010703': '数码配件'}, {'04010704': '电脑'}, {'04010705': '耳机音响'}]}");
                                offlineXfLabelMap.put("040108",
                                                "{'文化教育': [{'04010801': '办公文具'}, {'04010802': '工艺收藏'}, {'04010803': '儿童玩具'}, {'04010804': '教育培训'}, {'04010805': '体育用品'}, {'04010806': '乐器'}, {'04010807': '书店'}, {'04010808': '乐器行'}]}");
                                offlineXfLabelMap.put("040109",
                                                "{'化妆品': [{'04010901': '香氛精油'}, {'04010902': '彩妆'}, {'04010903': '护肤'}, {'04010904': '假发'}]}");
                                offlineXfLabelMap.put("040110",
                                                "{'餐饮': [{'04011001': '快餐简餐'}, {'04011002': '日料'}, {'04011003': '西餐正餐'}, {'04011004': '咖啡水吧'}, {'04011005': '零食小吃'}, {'04011006': '韩食'}, {'04011007': '中餐正餐'}, {'04011008': '面包甜点'}, {'04011009': '火锅涮锅'}, {'04011010': '自助餐'}, {'04011013': '茶座'}]}");
                                offlineXfLabelMap.put("040111",
                                                "{'家用电器': [{'04011101': '小家电'}, {'04011102': '厨房电器'}, {'04011103': '大家电'}]}");
                                offlineXfLabelMap.put("040112",
                                                "{'休闲娱乐': [{'04011201': '儿童娱乐'}, {'04011206': 'KTV服务'}, {'04011207': '桌游娱乐'}, {'04011212': '台球室'}, {'04011214': '网吧'}, {'04011215': '电影院'}, {'04011216': '足疗按摩'}, {'04011217': '体验/DIY'}, {'04011218': '洗浴'}]}");
                                offlineXfLabelMap.put("040113",
                                                "{'生活服务': [{'04011307': '摄影冲印'}, {'04011310': '花店/水果铺'}, {'04011312': '宠物服务'}, {'04011315': '药店'}, {'04011316': '租车服务'}, {'04011317': '保健品'}, {'04011320': '皮具保养'}, {'04011321': '图文快印'}, {'04011323': '邮局'}, {'04011324': '旅行社'}, {'04011325': '个性写真'}, {'04011326': '眼镜店'}, {'04011327': '快递公司'}]}");
                                offlineXfLabelMap.put("040114",
                                                "{'零售卖场': [{'04011401': '烟酒行'}, {'04011402': '杂货'}, {'04011403': '便利店'}, {'04011404': '数码卖场'}, {'04011405': '零售'}, {'04011406': '大型超市'}, {'04011407': '茶叶店'}, {'04011408': '家电卖场'}, {'04011409': '超市'}, {'04011410': '购物中心'}, {'04011411': '百货'}]}");
                                offlineXfLabelMap.put("040115",
                                                "{'汽车服务': [{'04011501': '汽车4S店'}, {'04011502': '汽车装饰'}, {'04011505': '汽车品牌'}, {'04011506': '汽车配件'}, {'04011508': '汽车维修'}]}");
                                offlineXfLabelMap.put("040117", "{'医疗': [{'04011701': '医疗器械'}, {'04011702': '中医馆'}]}");
                                offlineXfLabelMap.put("040119",
                                                "{'丽人': [{'04011901': '美发'}, {'04011902': '瘦身纤体'}, {'04011903': '美甲'}]}");
                                offlineXfLabelMap.put("040120", "{'金融': [{'04012001': '典当行'}, {'04012002': '证券公司'}]}");
                                offlineXfLabelMap.put("040121",
                                                "{'亲子': [{'04012101': '早教'}, {'04012102': '亲子教育'}, {'04012103': '月子中心'}, {'04012104': '亲子游乐'}]}");
                                offlineXfLabelMap.put("040122",
                                                "{'培训机构': [{'04012201': '考试培训'}, {'04012202': '语言培训'}]}");
                                offlineXfLabelMap.put("0402",
                                                "{'消费定位': [{'040201': '时尚品牌'}, {'040202': '高端品牌'}, {'040203': '大众品牌'}, {'040204': '奢侈品牌'}]}");
                        }

                        if (bankingLabelMap == null) {
                                bankingLabelMap = new LinkedHashMap<String, String>();
                                bankingLabelMap.put("0807",
                                                "{'金融': [{'080701': '传统券商证券'}, {'080702': '彩票'}, {'080703': 'P2P网贷'}, {'080704': '支付'}, {'080705': '众筹'}, {'080706': '记账'}, {'080707': '第三方卡管理'}, {'080708': '互联网理财'}, {'080709': '金融资讯'}, {'080710': '消费金融'}, {'080711': '手机银行'}, {'080712': '传统保险'}, {'080713': '传统基金'}, {'080714': '直销银行'}, {'080715': '互联网证券'}, {'080716': '银行信用卡'}, {'080717': '互联网保险'}]}");
                        }

                        if (personPropertiesMap == null) {
                                personPropertiesMap = new LinkedHashMap<String, String>();
                                personPropertiesMap.put("0301", "{'性别': [{'030101': '男'}, {'030102': '女'}]}");
                                personPropertiesMap.put("0302",
                                                "{'年龄': [{'030207': '19-25岁'}, {'030208': '26-35岁'}, {'030209': '36-45岁'}, {'030210': '46-55岁'}, {'030211': '55岁以上'}, {'030212': '19岁以下'}]}");
                                personPropertiesMap.put("0303",
                                                "{'家庭与身份': [{'030301': '大学生'}, {'030302': '医生'}, {'030402': '已婚'}, {'030501': '有车'}, {'080301': '准爸准妈'}, {'080302': '家有宝宝'}, {'08030202': '家有大宝宝'}, {'08030203': '家有小宝宝'}]}");
                        }
                }
        }

        @SuppressWarnings("unchecked")
        public static void main(String[] args) throws Exception {
                Map<String, String> dataMap = LabelDataBase.personPropertiesMap;
                for (Map.Entry<String, String> entry : dataMap.entrySet()) {
                        Map<String, Object> map = new Gson().fromJson(entry.getValue(), Map.class);
                        String title = map.entrySet().iterator().next().getKey();
                        System.out.println("title: " + title);
                        List<Map<String, String>> labelList = (List<Map<String, String>>) map.get(title);
                        for (Map<String, String> labelMap : labelList) {
                                System.out.println(labelMap);
                        }
                }

                System.out.println("================================");

                FileReader fileReader = new FileReader("C:/Users/Richard/Desktop/1.txt");
                BufferedReader reader = new BufferedReader(fileReader);
                String readline = null;
                String str = "";
                while ((readline = reader.readLine()) != null) {
                        String[] labels = readline.split("	");
                        String label_id = labels[0];
                        String label_name = labels[1];
                        if (label_id.length() == 4) {
                                if (!str.equals("")) {
                                        System.out.println(str + "]}\");");
                                }
                                str = "";
                                str += "applyInterestMap.put(\"" + label_id + "\", \"{'" + label_name + "': [";
                                continue;
                        }
                        str += "{'" + label_id + "': '" + label_name + "'}, ";
                        System.out.println(str);
                }
                reader.close();
                fileReader.close();
        }
}
